{"501":{"id":501,"title":"Rejestracja"},"502":{"id":502,"title":"Keynote"},"101":{"id":101,"title":"Android Tool Time: Holiday Special","description":"Garść nowości na styku Android Studio, Androida i Play Store, m.in.: o zmianach w Android Gradle plugin, które wpłyną na szybkość instalacji twojego APK, o tym jak Play Store uprawia czarną magię, by dostarczyć najmniejszy update na urządzenia, a w bonusie krótkie opowiadanie o optymalizacji aplikacji Santa Tracker. Plus 10 nowości, o których nie wiedzieliście (albo wiedzieliście - jestem programistą, a nie jasnowidzem).","language":"PL","tags":["Android","Android Studio"],"speakers":[1]},"102":{"id":102,"title":"RxJava 2","description":"RxJava 2 introduces new API and few important changes making it even more funnier to use than version 1. In my presentation I'll go through the new features and APIs, compare them to the original ones and explain what's the difference.","language":"PL","speakers":[2]},"103":{"id":103,"title":"(Prawdziwe) Bezpieczeństwo danych na Androidzie","description":"Czy zastanawiałeś się, jak długo wrażliwe dane użytkowników Twojej aplikacji pozostaną bezpieczne w obliczu takich zagrożeń jak:<br>– kradzież urządzenia<br>– rootowanie telefonu<br>– podsłuchiwanie komunikacji<br>– zrzut pamięci aplikacji<br>...?<br><br>Opowiemy Ci o praktycznych problemach, z którymi mierzymy się na co dzień, zapewniając najwyższy poziom zabezpieczeń w płatnościach mobilnych oraz uchylimy rąbka tajemnicy o najnowszych rozwiązaniach w tym zakresie. Na prezentacji zapoznasz się z aspektami bezpieczeństwa danych w urządzeniach z Androidem od trzech stron:<br>1. kryptografii – o czym należy pamiętać<br>2. bezpieczeństwa transportu – gdzie czai się niebezpieczeństwo<br>3. bezpieczeństwa przechowywania – różne podejścia oraz ich wady i zalety<br><br>Słowa kluczowe: Secure Element, Whitebox Cryptography, Trusted Execution Environment, End-to-end Security, Message Level Security","language":"PL","tags":["Android","Security","Cryptography","Secure Element","Trusted Execution Environment"],"speakers":[3]},"104":{"id":104,"title":"Obiad"},"105":{"id":105,"title":"TBA","description":"TBA","speakers":[5]},"106":{"id":106,"title":"Mikrointerakcje, czyli małe źródła dużej satysfakcji","description":"W dobie tysięcy podobnych funkcjonalnie stron i aplikacji to mikrointerakcje – najmniejsze z interakcji człowieka z oprogramowaniem - najczęściej decydują o tym, że przyjemnie się nam korzysta z danego produktu i że chcemy do niego wracać. W prezentacji przyjrzę się ich wykorzystaniu na stronach internetowych i w aplikacjach natywnych, ze szczególnym uwzględniem tych tworzonych przy użyciu material designu. Diabeł tkwi w szczegółach, a prostota i spójność nie wykluczają efektywności.","language":"PL","speakers":[6]},"107":{"id":107,"title":"Nearby Notifications - wkurzaj znajomych!","description":"Nearby Notifications jest nową technologią Google, która pozwala deweloperom na powiązanie aplikacji i stron internetowych z beaconami oraz na tworzenie kontekstowych notyfikacji, nawet jeśli aplikacja nie jest zainstalowana. W tej prezentacji wytłumaczę jak działają beacony Eddystone i iBeacon, podzielę się swoimi doświadczeniami z wdrażania tej technologii w projektach oraz pokażę jak (nie) wkurzać nią znajomych!","language":"PL","tags":["Android","Beacons","Psychical Web"],"speakers":[7]},"108":{"id":108,"title":"TBA","description":"TBA","speakers":[8]},"109":{"id":109,"title":"Kotlin dla programisty Android","description":"Kotlin jest nową alternatywą wśród języków wykorzystywanych na platformie Android, który dotychczas zdobył największe zainteresowanie (obok języka JAVA). Prezentacja pokazuje  jak w łatwy i bezbolesny sposób przejść z programowania w języku Java na programowanie w języku Kotlin. Opisuje dobre praktyki jakie należy stosować w języku Kotlin oraz odkrywa zalety tego języka. ","language":"PL","tags":["Android"],"speakers":[9]},"110":{"id":110,"title":"Android TDD Case Study","description":"W TDD (na Androida i nie tylko) piszę na codzień. W ramach prezentacji opowiem, jak taki proces wygląda, od czego się zaczęło i jakie widzimy w ramach całego zespołu korzyści płynące z tej metodyki wytwarzania oprogramowania.","language":"PL","speakers":[10]},"111":{"id":111,"title":"Android Auto","description":"Podczas prezentacji opowiem o kierunkach rozwoju technologii Connected Cars oraz przedstawię najpopularniejsze technologie. Szczególnie skupimy się na rozwiązaniu Android Auto. Zapoznamy się z zasadami projektowania aplikacji mobilnych dostępnych w samochodach, porozmawiamy o bezpieczeństwem kierowców oraz pokażę jak zintegrować naszą aplikację z Android Auto.","language":"PL","speakers":[11]},"112":{"id":112,"title":"~Dependency~ Library injection. How to extend any app without single line of code.","description":"It's not about dagger. It's about putting your source code to an Android binary. Yes the compiled dex code! During the presentation I will show in steps how to inject aar to apk without having original source code nor resources. ","language":"PL","tags":["Android","Hacking"],"speakers":[12]},"113":{"id":113,"title":"TBA","description":"TBA","speakers":[13]},"503":{"id":503,"title":"Zamknięcie imprezy"},"504":{"id":504,"title":"Afterparty"},"201":{"id":201,"title":"Nie chce mi się dla Ciebie projektować!","description":"Patrząc z perspektywy projektanta i programisty opowiemy o tym jak pracowaliśmy nad dostępnością naszej aplikacji dla wszystkich. Przedstawimy proces wdrażania rozwiązań dotyczących Accessibility w projekcie Shuttle. Opiszemy problemy i wyzwania jakie napotkaliśmy, starając się jednocześnie zwrócić uwagę na to, że trzeba zadbać o pozytywne doświadczenie każdego użytkownika.","language":"PL","tags":["UX Design","UI Design","Accessibility"],"speakers":[14]},"202":{"id":202,"title":"Web components @ scale","description":"Duże aplikacje pochłaniają mnóstwo czasu na to, aby je oprogramować i przygotować do środowiska produkcyjnego. Po jakimś czasie zmienia się technologia, powstają nowe frameworki, zmieniają się wymagania aplikacji i wtedy powrót do fazy programowania może być bardzo bolesne. W tej sesji poruszę temat standardów platformy web i jak je wykorzystać na korzyść pisania skalowalnej aplikacji oraz jak web komponenty pozwalają uwolnić od bardzo kosztownych zmian. Skupię się na frameworku Polymer (2.0) oraz na tym jak przejść z programowania na frameworku do programowania na platformie.","language":"PL","tags":["polymer","web"],"speakers":[15]},"203":{"id":203,"title":"Wanna more fire? - Let's try polymerfire!","description":"Have you ever tried to build Web application using Polymer with Firebase integration, additionally adhere to PWA's canons? I have, and know how many surprises can be found during developmet :). Polymerfire is a great Polymer Web Component Firebase and looks very easy to play with. During my talk I want to dive into tips & tricks on how you can integrate your web app on Polymer with Firebase + how to add offline support (since Firebase uses web sockets for data transferring, service worker will not help in that case).  ","language":"EN","speakers":[16]},"204":{"id":204,"title":"Going offline with Service Worker","description":"Last year brought a lot of new capabilities to browsers, fundamentally changing the way we will build web apps in the near future. Offline support is definitely one of the most exciting additions. In this talk, we will dive deep into Service Worker and see how we can use it in our apps.","language":"PL","speakers":[17]},"205":{"id":205,"title":"Obiad"},"206":{"id":206,"title":"Dobre wzorce projektowania UI dla VR","description":"W ramach prezentacji przedstawię jakie są obecnie najczęściej rozważane interfejsy dla Wirtualnej Rzeczywistości. Zastanowimy się co działa, a co warto jeszcze poprawić i gdzie jeszcze nie ma ustalonych standardów.","language":"PL","speakers":[19]},"207":{"id":207,"title":"TBA","description":"TBA","speakers":[20]},"208":{"id":208,"title":"Interfejsy głosowe w appkach - dlaczego warto, dlaczego teraz?","description":"Co stoi za dynamicznie rosnącą popularnością interfejsów głosowych i jak faktycznie wygląda ten trend. W jaki sposób warto wykorzystać je we współczesnych aplikacjach i o jakich dobrych praktykach należy pamiętać.","language":"PL","speakers":[21]},"209":{"id":209,"title":"Psychologia w UX czy manipulacja użytkownikiem?","description":"Prezentacja przedstawia zasady jakimi należy się kierować przy projektowaniu, aby zachęcić przyszłego użytkownika do korzystania z naszej usługi, produktu, strony internetowej czy aplikacji. Jak wzbudzać zaufanie użytkownika? Czy można oraz czy należy sprawiać, by uzależnił się od naszego produktu? Przedstawione zostaną przykłady pokazujące, że UX to nie tylko projektowanie stron i aplikacji, a zasady leżące u jego podstaw znajdują szerokie zastosowanie w projektowaniu szerzej pojętych doświadczeń użytkownika.","language":"PL","speakers":[22]},"210":{"id":210,"title":"10 porad dla startupów mobilnych - wersja 2016","description":"Na DevFeście 2015 przekazałem swoje 10 porad dla startupów mobilnych, w tym roku chciałbym udzielić uaktualnionej wersji tej prezentacji. Bazując na nowym doświadczeniu chciałbym podzielić się uwagami - co działa dobrze, na co uważać, a także jak pracować i około techniczne tematy. Porady będą zawierały odniesienia do aplikacji Yawn i tego co w naszym przypadku się sprawdziło a co nie.","language":"PL","speakers":[23]},"211":{"id":211,"title":"Optymalizacja wyszukiwań geo-danych w Firebase","description":"Pokażę w jaki sposób filtrować jednocześnie na 5 kluczach/wartościach. Naprawdę muszę tyle pisać teraz? Przysięgam, że dopełnię do końca...","language":"PL","speakers":[24]},"212":{"id":212,"title":"TBA","description":"TBA","speakers":[25]},"213":{"id":213,"title":"\"... as a Code\" - fakty i mity","description":"Recently software development and deployment goes toward \"Everything as a Code\" and continuous integration/delivery. Number of presentations show idealistic model of such process and methodology. Let's compare it to reality.","language":"PL","tags":["DevOps","Infrastructure","Automation"],"speakers":[26]},"301":{"id":301,"title":"TBA","description":"TBA","language":"PL","speakers":[27]},"302":{"id":302,"title":"Policy - panel dyskusyjny","description":"TBA","language":"PL","speakers":[28]},"303":{"id":303,"title":"Nowoczesne IT w Twojej organizacji - czy DevOps i chmura sprawią, że będziesz spać spokojniej?","description":"TBA","language":"PL","speakers":[29]},"304":{"id":304,"title":"Rx Java - Grzechy główne programistów oraz praktyczne zastosowania","description":"Czego powinniśmy unikać pisząc kod w Rx oraz praktyczne zastosowania reaktywnego kodu w androidzie","language":"PL","speakers":[30]},"305":{"id":305,"title":"VR - panel dyskusyjny","description":"TBA","language":"PL","speakers":[31]},"306":{"id":306,"title":"Obiad"},"307":{"id":307,"title":"VR","description":"TBA","language":"PL","speakers":[33]},"308":{"id":308,"title":"VR","description":"TBA","language":"PL","speakers":[34]},"310":{"id":310,"title":"Cloud Machine Learning","description":"Build smart applications using Cloud Vision, Cloud Speech, Natural Language API and TensorFlow.","language":"PL","speakers":[36]},"311":{"id":311,"title":"TBA","description":"TBA","speakers":[37]},"312":{"id":312,"title":"Jak przeskalować startup w rok","description":"Oczywiście z wykorzystaniem narzędzi Google (powodzenia bez Analytics). Mam duże doświadczenie w marketingu wszelkiej maści, od dużych agencji i lipnych KPI po właśnie startupy i mogę podpowiedzieć developerom, co i jak faktycznie warto robić.","language":"PL","speakers":[38]},"313":{"id":313,"title":"Let's make developers stand out!","description":"I believe that software engineers are people who decide how the world of tomorrow will look like. Basically we believe that they are super rock stars! During the speech I'd like to talk about hackathons and how we help all makers to stand out with ChallengeRocket.com .<br>I'd also like to shortly present backstory of our organization, tell some of my experience from various hackathons and discuss why it's great a thing for brands to build developer ecosystem around their organizations.","language":"PL","speakers":[39]}}
